group-reports/test-phase/results-after-queue/disk-throughput-tuning-protocol-B/test-2.txt
write-sequentially-test-job: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
write-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

write-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=27254: Tue Jul 11 01:49:40 2023
  write: IOPS=5, BW=22.8MiB/s (23.9MB/s)(13.4GiB/602681msec)
    slat (usec): min=89, max=1424, avg=173.82, stdev=74.84
    clat (msec): min=213, max=5230, avg=2811.01, stdev=151.12
     lat (msec): min=213, max=5230, avg=2811.19, stdev=151.11
    clat percentiles (msec):
     |  1.00th=[ 2635],  5.00th=[ 2735], 10.00th=[ 2802], 20.00th=[ 2802],
     | 30.00th=[ 2802], 40.00th=[ 2802], 50.00th=[ 2802], 60.00th=[ 2802],
     | 70.00th=[ 2802], 80.00th=[ 2802], 90.00th=[ 2836], 95.00th=[ 2903],
     | 99.00th=[ 3037], 99.50th=[ 3104], 99.90th=[ 4732], 99.95th=[ 5067],
     | 99.99th=[ 5201]
   bw (  KiB/s): min= 8175, max=40960, per=99.90%, avg=23273.85, stdev=4810.04, samples=1201
   iops        : min=    1, max=   10, avg= 5.59, stdev= 1.21, samples=1201
  lat (msec)   : 250=0.03%, 500=0.03%, 1000=0.12%
  cpu          : usr=0.55%, sys=0.11%, ctx=3680, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=99.6%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3428,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=22.8MiB/s (23.9MB/s), 22.8MiB/s-22.8MiB/s (23.9MB/s-23.9MB/s), io=13.4GiB (14.4GB), run=602681-602681msec

Disk stats (read/write):
    drbd1: ios=0/17178, merge=0/0, ticks=0/47350698, in_queue=47350698, util=99.79%, aggrios=1302/17205, aggrmerge=0/0, aggrticks=1447/19907639, aggrin_queue=19909086, aggrutil=48.98%
    dm-0: ios=1302/17205, merge=0/0, ticks=1447/19907639, in_queue=19909086, util=48.98%, aggrios=1273/17202, aggrmerge=38/3, aggrticks=1835/19900368, aggrin_queue=19893151, aggrutil=48.98%
  vdb: ios=1273/17202, merge=38/3, ticks=1835/19900368, in_queue=19893151, util=48.98%